--------------
<h2 style="color:blue;"><b>Pandas Data Structures & Operations</b></h2>

--------------------------

<ul style="color:SlateBlue;">
    <li>Python, at the beginning, was criticized as lack of useful data structures for performing data analysis tasks.</li>
    <li>This deficiency was addressed in 2008 with the introduce of Pandas and this module continues to be improved.</li>
    <li>Actually, Pandas module introduces several new data structures:</li>
    <ul style="color:DodgerBlue;">
        <li>DataFrame <span style="color:Grey;">(discussed already, more at a later stage)</span></li>
        <li>Series</li>
        <li>Panel</li>
    </ul>
    </ul>

--------------------
<h3 style="color:SlateBlue;">
    DataFrame</h3>
    <ul style="color:DodgerBlue;">
        <li>A two-dimensional labeled data structure with columns that can be hold different data types, similar to a spreadsheet or relational database table.</li>
        <li>Pandas also provides a date/time data structure, TimeSeries, and a three-dimensional data structure known as Panel.</li>
        <li>Among these (DataFRame, Series, Panel) DataFrame will be used the most.</li></ul>
   
--------------------------

In [1]:
## Create a DataFrame from dictionary
import pandas as pd

## Define dictionary used to create our DataFrames
dt = {'A' : [0, 1, 2, 3, None], 
      'B' : [5, 6, None, 8, 9], 
      'C' : [10, None, 12, 13, 14], 
      'D' : [15, 16, 17, 18, 19],
      'E' : [20, 21, None, None, 24]}

## Create default DataFrame
df = pd.DataFrame(dt, index=list('qwert'))   # use 'qwert' as index

## Fille the entry of NaN with null and display the DataFrame
df.fillna("")

   A  B   C   D   E
q  0  5  10  15  20
w  1  6      16  21
e  2     12  17
r  3  8  13  18
t     9  14  19  24

---------------------
<h3 style="color:SlateBlue;">Series</h3>
<ul style="color:DodgerBlue;">
    <li>A Series is useful to hold data that should be accessible by using a specific label.</li>
    <li>For example, we might use time or dates to reference a specific financial transaction. 
        we create a Series by passing in an appropriate data set along with an optional index:</li>
    </ul>
<span style="color:white;">..........</span><span style="color:orange;">values = pd.Series(data, index=idx)</span>

---------------------------------------

In [2]:
## Create a series with specified index
import pandas as pd

# Specify a label for the values
s1 = pd.Series(range(6), index=['p', 'y', 't', 'h', 'o', 'n'])
s1

p    0
y    1
t    2
h    3
o    4
n    5
dtype: int64

In [3]:
## Create a series from dictionary
import pandas as pd

d = {'q': [11, 16], 'w': [21, 58], 'e': [31, 63], 'r': [41, 88]}

## We pick out the q, w, and r keys, but have an undefined y key.
s2 = pd.Series(d, index = ['q', 'w', 'r', 'y'])
print(s2)

s2 = s2.fillna("")
print(s2)

q    [11, 16]
w    [21, 58]
r    [41, 88]
y         NaN
dtype: object
q    [11, 16]
w    [21, 58]
r    [41, 88]
y
dtype: object

---------------------
<h3 style="color:SlateBlue;">Data Selection on DataFrame</h3>
<table style="color:DodgerBlue;">
    <tr>
        <th>Selection</th>
        <th>Interpretation</th>
    </tr>
    <tr>
        <td>df[1 : 3]</td>
        <td>Select the second and third rows from df</td>
    </tr>
    <tr>
        <td>idf[0 : 2]</td>
        <td>Select first two rows from idf</td>
    </tr>
    <tr>
        <td>idf['q' : 'w']</td>
        <td>Select first two rows from idf</td>
    </tr>
    <tr>
        <td>df['A']</td>
        <td>Select first column from df, return a Series, known as dictionary-style index</td>
    </tr>
    <tr>
        <td>df[['A']]</td>
        <td>Select first column from df, return a DataFrame, known as explicit list-style index</td>
    </tr>
    <tr>
        <td>df[[0]]</td>
        <td>Select first column from df, return a DataFrame, known as implicit list-style index</td>
    </tr>
    <tr>
        <td>df[['B', 'D']]</td>
        <td>Select second and fourth column from df</td>
    </tr>
    <tr>
        <td>df[[1, 3]]</td>
        <td>Select second and fourth column from df</td>
    </tr>
    <tr>
        <td>df[0 : 2][['A', 'C']]</td>
        <td>Select first and third columdn only from the first two rows from df</td>
    </tr>
    <tr>
        <td>df[0 : 2][[0, 2]]</td>
        <td>Select first and third columdn only from the first two rows from df<td>
    </tr>
    </table>
    
----------------------------

In [16]:
## Slicing & indexing a dataframe by column label
import pandas as pd
sData = pd.read_excel('StudentData.xlsx')   ## read the excel file into sData

exeCol = sData["Exercise"]
print(exeCol.head())
print(type(exeCol), "\n")

examCol = sData[["Exam"]]
print(examCol.head())
print(type(examCol))

0    75
1    75
2    52
3    43
4    86
Name: Exercise, dtype: int64
<class 'pandas.core.series.Series'>

   Exam
0    91
1    79
2    75
3    80
4    76
<class 'pandas.core.frame.DataFrame'>

In [17]:
## Slicing & indexing a dataframe by row index
import pandas as pd
adf = pd.read_excel('airports.xlsx')
print(adf.head())

## Slice with row index
print(adf[101:106])

  iata               airport              city state country        lat  \
0  00M              Thigpen        Bay Springs    MS     USA  31.953765
1  00R  Livingston Municipal        Livingston    TX     USA  30.685861
2  00V           Meadow Lake  Colorado Springs    CO     USA  38.945749
3  01G          Perry-Warsaw             Perry    NY     USA  42.741347
4  01J      Hilliard Airpark          Hilliard    FL     USA  30.688012

         long
0  -89.234505
1  -95.017928
2 -104.569893
3  -78.052081
4  -81.905944
    iata             airport      city state country        lat       long
101  12J   Brewton Municipal   Brewton    AL     USA  31.051263 -87.067968
102  12K  Superior Municipal  Superior    NE     USA  40.046361 -98.060111
103  12Y  Le Sueur Municipal  Le Sueur    MN     USA  44.437465 -93.912741
104  13C            Lakeview  Lakeview    MI     USA  43.452137 -85.264803
105  13K    Eureka Municipal    Eureka    KS     USA  37.851582 -96.291698

In [18]:
## Slice rows by using the indicated label from the index column
import pandas as pd

## Read data from Excel file
airDF = pd.read_excel('Airports.xlsx', index_col='iata')

## Display certain rows according to the specified index column
print(airDF.loc[['11J', '11R', '12C', '12J']], "\n")

## Dispplay certain rows according to the specified row index
print(airDF[97:102])

                 airport      city state country        lat       long
iata
11J         Early County   Blakely    GA     USA  31.396986 -84.895257
11R    Brenham Municipal   Brenham    TX     USA  30.219000 -96.374278
12C   Rochelle Municipal  Rochelle    IL     USA  41.893001 -89.078290
12J    Brewton Municipal   Brewton    AL     USA  31.051263 -87.067968

                 airport      city state country        lat       long
iata
11J         Early County   Blakely    GA     USA  31.396986 -84.895257
11R    Brenham Municipal   Brenham    TX     USA  30.219000 -96.374278
12C   Rochelle Municipal  Rochelle    IL     USA  41.893001 -89.078290
12D      Tower Municipal     Tower    MN     USA  47.818333 -92.291667
12J    Brewton Municipal   Brewton    AL     USA  31.051263 -87.067968

In [19]:
## Slice rows by using the indicated label from the index column
import pandas as pd

## Read data from Excel file
airDF = pd.read_excel('Airports.xlsx', index_col='iata')

## Slice rows and columns by using explicit row and column labels
print(airDF.loc[['11R', '12C', '12D'], ['airport', 'city', 'state', 'country']], "\n")

## Slice rows and columns by using implicit row and column indices
print(airDF.iloc[100:103, 0:5])

                 airport      city state country
iata
11R    Brenham Municipal   Brenham    TX     USA
12C   Rochelle Municipal  Rochelle    IL     USA
12D      Tower Municipal     Tower    MN     USA

                 airport      city state country        lat
iata
12D      Tower Municipal     Tower    MN     USA  47.818333
12J    Brewton Municipal   Brewton    AL     USA  31.051263
12K   Superior Municipal  Superior    NE     USA  40.046361

------------------------
<h3 style="color:SlateBlue;">Masking Data</h3>
    <ul style="color:DodgerBlue;">
        <li>Masking, a process that supported by Pandas to select rows based on column values.</li>
        <li>This is performed by specifying conditional testing on columns that result in True or False, and only the True results are returned.</li>
        <li>That’s a row mask is formed, and masked rows are hidden and unmasked rows are displayed.</li>
        <li>These tests must follow the rules of Boolean logic, but can involve multiple column comparisons that are combined into one final result.</li>
    </ul>

----------------------------

In [5]:
## Mask the rows according to the conditional test on column(s) values
import pandas as pd

## Read data from Excel file
airDF = pd.read_excel('Airports.xlsx')

## Mask on column values
print(airDF[airDF.state == 'AL'])

     iata                            airport         city state country  \
6     02A                        Gragg-Wade       Clanton    AL     USA
15    06A                   Moton  Municipal     Tuskegee    AL     USA
25    08A                 Wetumpka Municipal     Wetumpka    AL     USA
29    09A              Butler-Choctaw County       Butler    AL     USA
35    0A8                        Bibb County  Centreville    AL     USA
...   ...                                ...          ...   ...     ...
2667  PRN               Greenville Municipal   Greenville    AL     USA
2897  SCD  Merkel Field Sylacauga Municipal     Sylacauga    AL     USA
2923  SEM                             Craig         Selma    AL     USA
3084  TCL               Tuscaloosa Municipal   Tuscaloosa    AL     USA
3120  TOI                     Troy Municipal         Troy    AL     USA

            lat       long
6     32.850487 -86.611453
15    32.460472 -85.680036
25    32.529439 -86.328221
29    32.119313 -88.127462
35    32.936791 -87.088883
...         ...        ...
2667  31.845402 -86.610446
2897  33.171836 -86.305538
2923  32.343947 -86.987803
3084  33.220627 -87.611401
3120  31.860417 -86.012139

[73 rows x 7 columns]

In [6]:
## Mask the rows according to the conditional test on column(s) values
import pandas as pd

## Read data from Excel file
airDF = pd.read_excel('Airports.xlsx')

## Mask based on boolean tests on multiple columns
print(airDF[(airDF.lat > 20) & (airDF.lat < 60) & (airDF.long < -150)])

     iata         airport           city state country        lat        long
123   17Z       Manokotak      Manokotak    AK     USA  58.988966 -159.049974
234   2A3      Larsen Bay     Larsen Bay    AK     USA  57.535107 -153.978417
440   4K0       Pedro Bay      Pedro Bay    AK     USA  59.789610 -154.123833
441   4K5        Ouzinkie       Ouzinkie    AK     USA  57.922876 -152.500511
498   5A8       Aleknagik      Aleknagik    AK     USA  59.282562 -158.617672
...   ...             ...            ...   ...     ...        ...         ...
3059  T44   Trident Basin         Kodiak    AK     USA  57.780833 -152.391389
3119  TOG  Togiak Village         Togiak    AK     USA  59.052842 -160.396934
3215  UPP           Upolu           Hawi    HI     USA  20.265256 -155.859987
3302  WSN  South Naknek 2   South Naknek    AK     USA  58.703436 -157.008251
3365  Z73   Nelson Lagoon  Nelson Lagoon    AK     USA  56.007536 -161.160367

[73 rows x 7 columns]

-----------------
<h3 style="color:SlateBlue;">Operation on Groups</h3>
<ul style="color:DodgerBlue;">
    <li>Groups can be operated by using similar techniques to the normal DataFrame.</li>
    <li>For example, statistical quantities such as the median or standard deviation can be computed for each group, as shown in the next few code cells.</li>
    <li>Multiple functions can be computed at once by using the aggregate method, which takes a list of the statistical functions to apply to each group.</li>
    </ul>

-------------------------------------

In [7]:
## Create a groupby DataFrame for further operations
import pandas as pd

## Read data from Excel file
tips = pd.read_excel('tips.xlsx')

gTips = tips.groupby("time")     # dataframe group by 'time'
print(type(gTips), "\n")
gTips.head(2)                    # display the first 2 records from each group

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

    Unnamed: 0  total_bill   tip     sex smoker   day    time  size
0            0       169.9  10.1  Female     No   Sun  Dinner     2
1            1       103.4  16.6    Male     No   Sun  Dinner     3
77          77       272.0  40.0    Male     No  Thur   Lunch     4
78          78       227.6  30.0    Male     No  Thur   Lunch     2

In [2]:
import pandas as pd

scname = r'D:\\Year2\\ISOM2007\\SalesConsultants.xlsx'
scData = pd.read_excel(scname)
smname =  r'D:\\Year2\\ISOM2007\\SalesManagers.xlsx'
smData = pd.read_excel(smname)

mdf = pd.merge(scData, smData, on='SID', how='left')
mdf['Annual Sales'] = mdf['Q1'] +  mdf['Q2'] + mdf['Q3'] + mdf['Q4'] 
print(mdf)

   AgentID  AgentName  SID      Q1       Q2       Q3       Q4      Supervisor  \
0   A94131     Harper  S01  407671   667749   955013  1173411    Rebecca Chao
1   A87141     Adalyn  S01  984033  1140601  1031040   753856    Rebecca Chao
2   A86822    Jackson  S01  232028   246208   899225   858954    Rebecca Chao
3   A78926      Jayce  S01  320194   731292   726855   830188    Rebecca Chao
4   A97353     Carson  S02  194479   311314  1188148   457629    Desmond Tung
5   A85279   Isabella  S02  597629   895707   803636   239411    Desmond Tung
6   A93404    Cameron  S02  313164   787874  1062551   411637    Desmond Tung
7   A77567      Wyatt  S03  864344   560440  1021992  1056099      Dennis Kun
8   A74694     Hannah  S03  642728   419636   563846  1158453      Dennis Kun
9   A86056       Liam  S04  746896   379949  1115037   565669  Alexandra Chow
10  A98957    Madelyn  S04  333445   290025   331527   642934  Alexandra Chow
11  A98711       Jack  S04  731634   360928   746409   867371  Alexandra Chow
12  A97264       Nora  S04  352990   908904  1189336   365842  Alexandra Chow
13  A98635      Caden  S04  899854  1096503   968648   373337  Alexandra Chow
14  A77666        Leo  S05  821798  1001980   335727   251269       Pong Shiu
15  A82229      Mason  S05  411738   791545  1091017   659842       Pong Shiu
16  A72812       Luna  S05  949814  1102871   600057  1092933       Pong Shiu
17  A96889      James  S05  446079   373552   806521  1074151       Pong Shiu
18  A94911       Mila  S05  135616   430220   811900   771738       Pong Shiu
19  A95818    Paisley  S06  313881   929049   319996   345119       Iris Wong
20  A77579       Isla  S06  786579   359433   814488   358349       Iris Wong
21  A93805      Caleb  S06  790245  1030669   730246  1117777       Iris Wong
22  A88957   Scarlett  S06  358198   995907   680563   557933       Iris Wong
23  A76050  Alexander  S06  173099   278356   973562   320732       Iris Wong

    Annual Sales
0        3203844
1        3909530
2        2236415
3        2608529
4        2151570
5        2536383
6        2575226
7        3502875
8        2784663
9        2807551
10       1597931
11       2706342
12       2817072
13       3338342
14       2410774
15       2954142
16       3745675
17       2700303
18       2149474
19       1908045
20       2318849
21       3668937
22       2592601
23       1745749

In [8]:
## Create a groupby DataFrame for further operations
import pandas as pd

## Read data from Excel file
tips = pd.read_excel('tips.xlsx')
gTips = tips.groupby("time")     # dataframe group by 'time'

## Compute median and standard deviation for each column in each group
print(gTips.median(), "\n")

# Compute the mean and the standard deviation for each column in each group
print(gTips.aggregate(['mean', 'std']))

        Unnamed: 0  total_bill   tip  size
time
Dinner       100.5      183.90  30.0   2.0
Lunch        137.5      159.65  22.5   2.0

        Unnamed: 0             total_bill                   tip             \
              mean        std        mean        std       mean        std
time
Dinner  111.630682  75.833916  207.971591  91.420292  31.026705  14.362428
Lunch   147.044118  46.141390  171.686765  77.138818  27.280882  12.053454

            size
            mean       std
time
Dinner  2.630682  0.910241
Lunch   2.411765  1.040024

----------------
<h3 style="color:SlateBlue;">Pivot Tables</h3>
<ul style="color:DodgerBlue;">
    <li>Pivot table is powerful for summarizing a large data set by grouping data together over multiple columns.</li>
    <li>Pivot table can also display summary information for the new representation such as average or standard deviation.</li>
    <li>In Pandas, pivot table can be created by using the pivot_table function.</li>
    <li>This function takes one argument that specifies the column that should be aggregated.</li>
    <li>The index argument is used to specify the row indices, which specifies how the DataFrame rows are grouped.</li>
    <li>The columns argument specifies the columns that are displayed in the pivot table, and the aggfunc argument specifies which functions should be computed and displayed for the group data; default value is simply the average.</li>
    </ul>
    
--------------------------------------

In [9]:
## Create a Pivot Table using the sex column as the vertical index 
## and the day column as the horizontal index
import pandas as pd

## Read data from Excel file
tipsDF = pd.read_excel('tips.xlsx')
print(tipsDF.sample(5))

## Generate the pivot table accordingly
tipsDF.pivot_table('total_bill', index='sex', columns='day')

     Unnamed: 0  total_bill   tip     sex smoker   day    time  size
32           32       150.6  30.0  Female     No   Sat  Dinner     2
238         238       358.3  46.7  Female     No   Sat  Dinner     3
118         118       124.3  18.0  Female     No  Thur   Lunch     2
78           78       227.6  30.0    Male     No  Thur   Lunch     2
205         205       164.7  32.3  Female    Yes  Thur   Lunch     3

day            Fri         Sat         Sun        Thur
sex
Female  141.455556  196.803571  198.722222  167.153125
Male    198.570000  208.025424  218.872414  187.146667

In [11]:
## Create a Pivot Table using the day column as the vertical index 
## and the sex column as the horizontal index
import pandas as pd

## Read data from Excel file
tipsDF = pd.read_excel('tips.xlsx')

## Generate the pivot table accordingly
tipsDF.pivot_table('total_bill', index='day', columns='sex')

sex       Female        Male
day
Fri   141.455556  198.570000
Sat   196.803571  208.025424
Sun   198.722222  218.872414
Thur  167.153125  187.146667

In [12]:
# Create a Pivot Table using the sex column as the vertical index 
# and the day column as the horizontal index. This time include margin
# data for each row and column.
import pandas as pd

## Read data from Excel file
tipsDF = pd.read_excel('tips.xlsx')

## Generate the pivot table accordingly
tipsDF.pivot_table('total_bill', index='day', columns='sex', margins=all)

sex       Female        Male         All
day
Fri   141.455556  198.570000  171.515789
Sat   196.803571  208.025424  204.413793
Sun   198.722222  218.872414  214.100000
Thur  167.153125  187.146667  176.827419
All   180.568966  207.440764  197.859426

In [13]:
# Create a Pivot Table using the sex column as the vertical index 
# and the day and smoker columns as the hierarchical horizontal index
import pandas as pd

## Read data from Excel file
tipsDF = pd.read_excel('tips.xlsx')

## Generate the pivot table accordingly
tipsDF.pivot_table('total_bill', index=['day', 'smoker'], columns='sex')

sex              Female        Male
day  smoker
Fri  No      193.650000  174.750000
     Yes     126.542857  204.525000
Sat  No      190.038462  199.290625
     Yes     202.666667  218.377778
Sun  No      208.242857  204.032558
     Yes     165.400000  261.413333
Thur No      160.144000  184.865000
     Yes     192.185714  191.710000

In [14]:
# Create a Pivot Table using the day column as the horizontal index 
# and the sex and smoker columns as the hierarchical vertical index
import pandas as pd

## Read data from Excel file
tipsDF = pd.read_excel('tips.xlsx')

## Generate the pivot table accordingly
tipsDF.pivot_table('total_bill', index='day', columns=['sex', 'smoker'])

sex         Female                    Male
smoker          No         Yes          No         Yes
day
Fri     193.650000  126.542857  174.750000  204.525000
Sat     190.038462  202.666667  199.290625  218.377778
Sun     208.242857  165.400000  204.032558  261.413333
Thur    160.144000  192.185714  184.865000  191.710000

In [15]:
# Create a Pivot Table using the sex column as the horizontal index 
# and the day column as the horizontal index. Display aggregate max, 
# median, and min for the total_bill column.
import pandas as pd

## Read data from Excel file
tipsDF = pd.read_excel('tips.xlsx')

## Generate the pivot table accordingly
tipsDF.pivot_table(index='day', columns='sex', aggfunc={'total_bill': ['max', 'median', 'min']})

     total_bill
            max         median            min
sex      Female   Male  Female    Male Female  Male
day
Fri       227.5  401.7  153.80  172.15   57.5  85.8
Sat       443.0  508.1  183.60  182.40   30.7  77.4
Sun       352.6  481.7  174.10  207.25   96.0  72.5
Thur      431.1  411.9  137.85  169.75   83.5  75.1

-----------------
<h3 style="color:blue;"><b>Student Practice #1</b></h3>
<p style="color:SlateBlue;">In the empty cell below, first create a Pandas `DataFrame` with 25 elements ranging from `1` to `25`, with row indices assigned automatically and column labels equal to the characters: `b`, `d`, `f`, `g`, and `j`. Next, select the subset of this `DataFrame` corresponding to the second-fourth rows and columns (so nine total entries). Multiply this new `DataFrame` by `10`, and subtract `5`. Finally, apply the `describe` function to the resultant `DataFrame`.</p>

-------------

------------------
<h3 style="color:blue;"><b>Student Practice #2</b></h3>
<p style="color:SlateBlue;">In the empty cell below, first extract all airports in the state of California. Second, apply a mask to select only those rows with a latitude between 38 and 40. Finally, compute and display the average and standard deviation of the longitude for these masked rows.</p>

----------------------

------------
<h3 style="color:blue;"><b>Student Practice #3</b></h3>
<p style="color:SlateBlue;">In the empty Code cell below, first group the DataFrame of tips by the smoker column. Next, compute and display the minimum, maximum, and median values for the new grouped DataFrame by using the aggregate function correctly. Finally, compute the row index for the maximum total_bill for the smoker group.</p>

-------------------

---------------
<h3 style="color:blue;"><b>Student Practice #4</b></h3>
<p style="color:SlateBlue;">In the empty Code cell below, input tips.xlsx as a DataFrame create a pivot table on this DataFrame using the time column as the horizontal index and the sex column as the vertical index. Compute and display the mean and standard deviation for the tips column in this pivot table.</p>

----------------------